МедПредыМобильные/src/Documents/Визит/Визит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Визит</name>
  <basedOn>Catalog.Контрагенты</basedOn>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ПрофилиМобильногоПриложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВизита</name>
    <type>
      <types>EnumRef.ВидыВизитов</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеВизита</name>
    <type>
      <types>EnumRef.СостоянияВизитов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзЦентральнойБазы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГеоМеткаНачало</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачало</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ГеоМеткаОкончание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончание</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Пункт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Препараты</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Матрица</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наличие</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МедПредыМобильные/src/Enums/ПрофилиМобильногоПриложения/ПрофилиМобильногоПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПрофилиМобильногоПриложения</name>
  <enumValues>
    <name>Супервайзер</name>
  </enumValues>
  <enumValues>
    <name>МедПредставитель</name>
  </enumValues>
</mdclass:Enum>

МедПредыМобильные/src/Enums/ВидыКонтрагентов/ВидыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКонтрагентов</name>
  <enumValues>
    <name>ЛПУ</name>
  </enumValues>
  <enumValues>
    <name>Аптека</name>
  </enumValues>
</mdclass:Enum>

МедПредыМобильные/src/Enums/СостоянияВизитов/СостоянияВизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияВизитов</name>
  <enumValues>
    <name>Открыт</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

МедПредыМобильные/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <attributes>
    <name>ЛПУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аптеки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цикличность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Пункт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Препараты</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Конкуренты</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

МедПредыМобильные/src/Documents/Визит/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем КэшНайденныхКонтактов;

#Область ПроцедурыИФункцииОбщегоНазначения

&НаСервере
Процедура СформироватьФормуВизита()
	
	Если Объект.Операция = ПредопределенноеЗначение("Перечисление.ПрофилиМобильногоПриложения.МедПредставитель") Тогда
		Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
			Если ЭтоАптека() Тогда
				СформироватьТоварыИЦены();
			Иначе
				СформироватьЧекЛист();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	УстановитьВидимостьСобытия();
	
КонецПроцедуры

&НаСервере
Функция ЭтоАптека()
	
	ЭтоАптека = (Объект.Контрагент.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.Аптека"));
	Возврат ЭтоАптека;

КонецФункции

&НаСервере
Процедура СформироватьЧекЛист()
	
	Объект.Препараты.Очистить();
	Объект.Цены.Очистить();
	
	Для Каждого ПунктЧекЛиста Из Объект.Проект.ЧекЛист Цикл
		НовыйПункт = Объект.ЧекЛист.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйПункт, ПунктЧекЛиста);
		НовыйПункт.Значение = ПустоеЗначение(НовыйПункт.ТипЗначения);		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьТоварыИЦены()
	
	Объект.ЧекЛист.Очистить();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПроектыПрепараты.Товар
	|ИЗ
	|	Справочник.Проекты.Препараты КАК ПроектыПрепараты
	|ГДЕ
	|	ПроектыПрепараты.Ссылка = &Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПроектыПрепараты.Товар,
	|	ЛОЖЬ КАК Конкурент
	|ИЗ
	|	Справочник.Проекты.Препараты КАК ПроектыПрепараты
	|ГДЕ
	|	ПроектыПрепараты.Ссылка = &Проект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПроектыКонкуренты.Товар,
	|	ИСТИНА
	|ИЗ
	|	Справочник.Проекты.Конкуренты КАК ПроектыКонкуренты
	|ГДЕ
	|	ПроектыКонкуренты.Ссылка = &Проект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Конкурент"
	;
	Запрос = Новый Запрос(ТекстЗапроса);

	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	
	Результаты = Запрос.ВыполнитьПакет();
	Объект.Препараты.Загрузить(Результаты[0].Выгрузить());
	Объект.Цены.Загрузить(Результаты[1].Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСобытия(ТекущийОбъект = Неопределено)
	
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = Объект;
	КонецЕсли;
	
	Если ТекущийОбъект.Операция = Перечисления.ПрофилиМобильногоПриложения.Супервайзер Тогда
		Элементы.Супервайзер.Видимость = Истина;
		Элементы.МедПредставитель.Видимость = Ложь;
		Элементы.Ответственный.Видимость = Истина;
	Иначе
		Если ЗначениеЗаполнено(ТекущийОбъект.Контрагент) Тогда
			ЭтоАптека = ЭтоАптека();
			
			Элементы.СтраницаЧекЛист.Видимость = НЕ ЭтоАптека;
			Элементы.СтраницаПрепараты.Видимость = ЭтоАптека;
			Элементы.СтраницаЦены.Видимость = ЭтоАптека;
			
			Если ЭтоАптека Тогда
				Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Пролистывание;
			Иначе
				Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ТекущийОбъект.СостояниеВизита = Перечисления.СостоянияВизитов.Закрыт Тогда
		Если НЕ Константы.ПрофильМобильногоПриложения.Получить() = Перечисления.ПрофилиМобильногоПриложения.Супервайзер Тогда
			Элементы.СостояниеВизита.СписокВыбора.Удалить(3);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьФорму(Заблокировать = Ложь)
	Элементы.ГруппаКолонки.Доступность = Заблокировать;
	Элементы.ВидВизита.Доступность = Заблокировать;
	Элементы.Прокрутка.Доступность = Заблокировать;
	//Элементы.ГруппаКоординаты.Доступность = Заблокировать;
	//Элементы.Ответственный.Доступность = Заблокировать;
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандныхПанелейФормы

&НаКлиенте
Процедура Справка(Команда)
	
	ПерейтиПоНавигационнойСсылке("http://server.prof-it.ru/redmine/projects/dfgwiki/wiki/Wiki");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если МобильноеПриложениеКлиент Тогда
		Если Не ЗначениеЗаполнено(Объект.ДатаНачало) Тогда
			ЗаписатьГеоДанные(МедПредыГеолокация.ПолучитьКоординаты(), "Начало");
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция ПустоеЗначение(ТипЗначения)
	Если ТипЗначения = "Строка" Тогда
		Возврат "";
	ИначеЕсли ТипЗначения = "Число" Тогда
		Возврат 0;
	ИначеЕсли ТипЗначения = "Дата" Тогда
		Возврат Дата(1,1,1);
	ИначеЕсли ТипЗначения = "Булево" Тогда
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//ОбщегоНазначенияСервер.УстановитьЗаголовокФормы(ЭтаФорма, НСтр("ru='Визит';en='Visit'"));
	
	УстановитьВидимостьСобытия(ТекущийОбъект);
	ЭтаФорма.ТолькоПросмотр = (ТекущийОбъект.СостояниеВизита = Перечисления.СостоянияВизитов.Закрыт) И Объект.Проведен;
	
	ФотоАдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый Картинка(ТекущийОбъект.Картинка.Получить()));
	
	Если ТекущийОбъект.СостояниеВизита = Перечисления.СостоянияВизитов.Выполнен Тогда
		ЗаблокироватьФорму();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзменилсяВизит", Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СозданНовыйКонтрагент" Тогда
		Объект.Контрагент = Параметр;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕСли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	МенеджерКонтактовКлиент.ЗаполнитьСписокВыбораИзКонтактнойКниги(
	Текст,
	ДанныеВыбора,
	СтандартнаяОбработка,
	КэшНайденныхКонтактов,
	Истина
	);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	МенеджерКонтактовКлиент.ОбработкаВыбора(
	Элемент,
	ВыбранноеЗначение,
	СтандартнаяОбработка,
	ЭтаФорма,
	КэшНайденныхКонтактов
	);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	 СформироватьФормуВизита();
	 
КонецПроцедуры

&НаСервере
Процедура ЗаписатьГеоДанные(ДанныеМестоположения, Момент)
	
	//ОбъектДляЗаписи = РеквизитФормыВЗначение("Объект");
	Объект["Дата"+Момент]       = ТекущаяДата();
	Попытка
		ЭтаФорма["ГеоМетка"+Момент] = ПоместитьВоВременноеХранилище(Новый ХранилищеЗначения(ДанныеМестоположения.Координаты), УникальныйИдентификатор);
	Исключение
		Сообщить("Местоположение неопределено!", СтатусСообщения.ОченьВажное);
	КонецПопытки;
	//ОбъектДляЗаписи.Записать(РежимЗаписиДокумента.Запись);
	//ЗначениеВРеквизитФормы(ОбъектДляЗаписи, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	#Если МобильноеПриложениеКлиент Тогда
		Если Не ЗначениеЗаполнено(Объект.ДатаОкончание) Тогда
			ЗаписатьГеоДанные(МедПредыГеолокация.ПолучитьКоординаты(), "Окончание");
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры


&НаСервере
Функция ПередЗакрытиемНаСервере()
	Если ЭтаФорма.Модифицированность Тогда
		ОбъектДокумента = РеквизитФормыВЗначение("Объект");
		Возврат НЕ ОбъектДокумента.ПроверитьЗаполнение();
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = ПередЗакрытиемНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Модифицированность = Ложь;
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ЭтоНовый() Тогда
		Если ЗначениеЗаполнено(ПровайдерГеоданных) Тогда 
			ТекущийОбъект.Комментарий = ТекущийОбъект.Комментарий + Символы.ПС + ПровайдерГеоданных;
			ТекущийОбъект.ГеоМеткаНачало = Новый ХранилищеЗначения(Новый ГеографическиеКоординаты(0,0));
			ТекущийОбъект.ГеоМеткаОкончание = Новый ХранилищеЗначения(Новый ГеографическиеКоординаты(0,0));
		Иначе
			ТекущийОбъект.ГеоМеткаНачало = ПолучитьИзВременногоХранилища(ЭтаФорма.ГеоМеткаНачало);
			ТекущийОбъект.ГеоМеткаОкончание = ПолучитьИзВременногоХранилища(ЭтаФорма.ГеоМеткаОкончание);
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ФотоАдресФайлаВоВременномХранилище) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФотоАдресФайлаВоВременномХранилище);
		ТекущийОбъект.Картинка = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СостояниеВизитаПриИзменении(Элемент)
	Если (Объект.СостояниеВизита = ПредопределенноеЗначение("Перечисление.СостоянияВизитов.Выполнен"))
	   ИЛИ (Объект.СостояниеВизита = ПредопределенноеЗначение("Перечисление.СостоянияВизитов.Закрыт")) Тогда
		ЗаблокироватьФорму();
	Иначе
		ЗаблокироватьФорму(Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Если ТекущийОбъект.ЭтоНовый() Тогда
		Если Константы.ПрофильМобильногоПриложения.Получить() = Перечисления.ПрофилиМобильногоПриложения.Супервайзер Тогда
			ТекущийОбъект.Операция =  Перечисления.ПрофилиМобильногоПриложения.Супервайзер;
		КонецЕсли;
		ТекущийОбъект.Проект = Константы.ТекущийПроект.Получить(); 
		Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Проект) Тогда
			Сообщить("Не задан проект на рабочем столе!");
			Отказ = Истина;
		КонецЕсли;
		ТекущийОбъект.Контрагент = Константы.ТекущийКонтрагент.Получить(); 		
		Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Контрагент) Тогда
			Сообщить("Не задан контрагент на рабочем столе!");
			Отказ = Истина;
		КонецЕсли;
		ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
		СформироватьФормуВизита();
	КонецЕсли;
	
	//ОбщегоНазначенияСервер.УстановитьЗаголовокФормы(ЭтаФорма, НСтр("ru='Визит';en='Visit'"));
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоПриИзменении(Элемент)
	КонтактноеЛицоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтактноеЛицоПриИзмененииНаСервере()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Визит.Ссылка
	|ИЗ
	|	Документ.Визит КАК Визит
	|ГДЕ
	|	Визит.Проект = &Проект
	|	И Визит.Контрагент = &Контрагент
	|	И Визит.КонтактноеЛицо = &КонтактноеЛицо
	|	И Визит.Дата >= ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -&Цикличность)
	|	И Визит.Операция = ЗНАЧЕНИЕ(Перечисление.ПрофилиМобильногоПриложения.МедПредставитель)"
	;
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);	
	Запрос.УстановитьПараметр("КонтактноеЛицо", Объект.КонтактноеЛицо);
	Запрос.УстановитьПараметр("Цикличность", Объект.Проект.Цикличность);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Сообщить(СтрШаблон("С предыдущего визита не прошло требуемое количество дней %1", Объект.Проект.Цикличность), СтатусСообщения.Внимание);
		Объект.КонтактноеЛицо = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияДобавитьФотоНажатие(Элемент)
	#Если МобильноеПриложениеКлиент Тогда
		Фото = СредстваМультимедиа.СделатьФотоснимок(, Новый РазрешениеКамерыУстройства(1280, 720), ?(ОбщегоНазначенияВызовСервера.ВерсияОС()="iOS", 50, 100));
		Если Фото <> Неопределено Тогда
			ФотоАдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(Фото.ПолучитьДвоичныеДанные(), УникальныйИдентификатор);
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

#КонецОбласти
